package com.example.myapplication.Activiy.Phone

class CountyData {

    companion object{
        val countryName = arrayOf(
            "افغانستان", "آلبانیا",
            "الجزیره", "آندورا", "آنگولا", "قطب جنوب", "آرژانتین",
            "ارمنستان", "آروبا", "استرالیا", "اتریش", "آذربایجان",
            "بحرین", "بنگلادش", "بلاروس", "بلژیک", "بلیز", "بنین",
            "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
            "برزیل", "برونئی داروسلام", "بلغارستان", "بورکینا فاسو",
            "میانمار", "بوروندی", "کامبوج", "کامرون", "کانادا",
            "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین",
            "جزیره کریسمس", "جزایر کوکو (keeling)", "کلمبیا",
            "کومور", "کنگو", "جزایر کوک", "کاستاریکا", "کرواسی",
            "کوبا", "قبرس", "جمهوری چک", "دانمارک", "جیبوتی",
            "تیمور لست", "اکوادور", "مصر", "السالوادور",
            "گینه استوایی", "اریتره", "استونی", "اتیوپی",
            "جزایر فالکلند (مالوینا)", "جزایر فارو", "فیجی", "فنلاند",
            "فرانسه", "پلی‌نزی فرانسه", "گابن", "گامبیا", "جورجیا",
            "آلمان", "غنا", "جبل الطارق", "یونان", "گرینلند",
            "گواتمالا", "گینه", "گینه بیسائو", "گویان", "هائیتی",
            "هندوراس", "هنگ کنگ", "مجارستان", "هند", "اندونزی", "ایران",
            "عراق", "ایرلند", "Isle of Man", "اسرائیل", "ایتالیا", "ساحل عاج",
            "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی",
            "کویت", "قرقیزستان", "لائوس", "لتونی", "لبنان", "لسوتو",
            "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ",
            "ماکائو", "مقدونیه", "ماداگاسکار", "مالاوی", "مالزی",
            "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی",
            "موریس", "مایوت", "مکزیک", "میکرونزی", "مولداوی",
            "موناکو", "مغولستان", "مونته نگرو", "مراکش", "موزامبیک",
            "نامیبیا", "نائورو", "نپال", "هلند", "کالدونیای جدید",
            "نیوزلند", "نیکاراگوئه", "نیجر", "نیجریه", "نیو", "کره",
            "نروژ", "عمان", "پاکستان", "پالائو", "پاناما",
            "پاپوا گینه نو", "پاراگوئه", "پرو", "فیلیپین", "Pitcairn",
            "لهستان", "پرتغال", "پورتوریکو", "قطر", "رومانی",
            "فدراسیون روسیه", "رواندا", "سنت بارتلی", "ساموآ",
            "سان مارینو", "سائو توئه و پرنسیپ", "عربستان سعودی", "سنگال",
            "صربستان", "سیشل", "سیرالئون", "سنگاپور", "اسلواکی",
            "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی",
            "کره ,جمهوری اف", "اسپانیا", "سری لانکا", "سنت هلنا",
            "سنت پیر و میکلون", "سودان", "سورینام", "سوازیلند",
            "سوئد", "سوئیس", "جمهوری عربی سوریه", "تایوان",
            "تاجیکستان", "تانزانیا", "تایلند", "توگو", "توکلائو", "تونگا",
            "تونس", "ترکیه", "ترکمنستان", "تووالو",
            "امارات متحده عربی", "اوگاندا", "انگلیس", "اوکراین",
            "اروگوئه", "ایالات متحده", "ازبکستان", "وانواتو",
            "مقدس مقدس (ایالت واتیکان شهر)", "ونزوئلا", "ویتنام",
            "والیس و فوتونا", "یمن", "زامبیا", "زیمبابوه"
        )

        val countryCode = arrayOf(
            "93", "355", "213",
            "376", "244", "672", "54", "374", "297", "61", "43", "994", "973",
            "880", "375", "32", "501", "229", "975", "591", "387", "267", "55",
            "673", "359", "226", "95", "257", "855", "237", "1", "238", "236",
            "235", "56", "86", "61", "61", "57", "269", "242", "682", "506",
            "385", "53", "357", "420", "45", "253", "670", "593", "20", "503",
            "240", "291", "372", "251", "500", "298", "679", "358", "33",
            "689", "241", "220", "995", "49", "233", "350", "30", "299", "502",
            "224", "245", "592", "509", "504", "852", "36", "91", "62", "98",
            "964", "353", "44", "972", "39", "225", "1876", "81", "962", "7",
            "254", "686", "965", "996", "856", "371", "961", "266", "231",
            "218", "423", "370", "352", "853", "389", "261", "265", "60",
            "960", "223", "356", "692", "222", "230", "262", "52", "691",
            "373", "377", "976", "382", "212", "258", "264", "674", "977",
            "31", "687", "64", "505", "227", "234", "683", "850", "47", "968",
            "92", "680", "507", "675", "595", "51", "63", "870", "48", "351",
            "1", "974", "40", "7", "250", "590", "685", "378", "239", "966",
            "221", "381", "248", "232", "65", "421", "386", "677", "252", "27",
            "82", "34", "94", "290", "508", "249", "597", "268", "46", "41",
            "963", "886", "992", "255", "66", "228", "690", "676", "216", "90",
            "993", "688", "971", "256", "44", "380", "598", "1", "998", "678",
            "39", "58", "84", "681", "967", "260", "263"
        )


        val PHONE_KEY_EXTRA = "phonenumber"

    }




}
